Repository: lacklusteradmin/SpectraWallet
Catalog: Spectra/Views/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Unsigned Tron transaction is missing txID.
zh_hans: 未签名的 Tron 交易缺少 txID。
zh_hant: 未簽名的 Tron 交易缺少 txID。

source: Unsupported Bitcoin derivation path: %@
zh_hans: 不支持的 Bitcoin 派生路径：%@
zh_hant: 不支持的 Bitcoin 派生路徑：%@

source: USDT on Tron uses TRX for network fees. Keep a TRX balance for gas.
zh_hans: Tron 上的 USDT 使用 TRX 支付网络费。请保留一定 TRX 作为 gas。
zh_hant: Tron 上的 USDT 使用 TRX 支付網絡費。請保留一定 TRX 作為 gas。

source: Use Custom Fees
zh_hans: 使用自定义费用
zh_hant: 使用自定義費用

source: Use Face ID
zh_hans: 使用 Face ID
zh_hant: 使用 Face ID

source: Use this mode only if you need near-real-time updates.
zh_hans: 只有在你需要接近实时更新时才使用此模式。
zh_hant: 只有在你需要接近實時更新時才使用此模式。

source: Used as the default for Bitcoin sends. You can still override before broadcasting.
zh_hans: 作为 Bitcoin 发送的默认值。广播前你仍然可以覆盖。
zh_hant: 作為 Bitcoin 發送的默認值。廣播前你仍然可以覆蓋。

source: Using
zh_hans: 使用中
zh_hant: 使用中

source: UTXO providers disagree on spendable set (no overlap). Refusing to build Dogecoin transaction.
zh_hans: UTXO 提供方对可花费集合存在分歧（无重叠）。拒绝构建 Dogecoin 交易。
zh_hant: UTXO 提供方對可花費集合存在分歧（無重疊）。拒絕構建 Dogecoin 交易。

source: UTXO providers returned conflicting values for the same outpoint. Refusing to build Dogecoin transaction.
zh_hans: UTXO 提供方对同一 outpoint 返回了冲突值。拒绝构建 Dogecoin 交易。
zh_hant: UTXO 提供方對同一 outpoint 返回了衝突值。拒絕構建 Dogecoin 交易。

source: Valid %@ address.
zh_hans: 有效的 %@ 地址。
zh_hant: 有效的 %@ 地址。

source: Wallet
zh_hans: 钱包
zh_hant: 錢包

source: Wallet & Transfers
zh_hans: 钱包与转账
zh_hant: 錢包與轉賬

source: Wallet Address
zh_hans: 钱包地址
zh_hant: 錢包地址

source: Wallet Details
zh_hans: 钱包详情
zh_hant: 錢包詳情

source: Wallet ID
zh_hans: 钱包 ID
zh_hant: 錢包 ID

source: Wallet Password
zh_hans: 钱包密码
zh_hant: 錢包密碼

source: Wallet-chain context mismatch detected for this send.
zh_hans: 检测到此次发送的钱包与链上下文不匹配。
zh_hant: 檢測到此次發送的錢包與鏈上下文不匹配。

source: wallet: %@
zh_hans: 钱包：%@
zh_hant: 錢包：%@

# wallet.detail.onChainLowercase
source: on %@
zh_hans: 在 %@ 上
zh_hant: 在 %@ 上

source: WalletCore produced an empty transaction payload.
zh_hans: WalletCore 生成了空交易载荷。
zh_hant: WalletCore 生成了空交易載荷。

source: WalletCore returned an empty Ed25519 signature.
zh_hans: WalletCore 返回了空的 Ed25519 签名。
zh_hant: WalletCore 返回了空的 Ed25519 簽名。

source: WalletCore returned an empty extrinsic.
zh_hans: WalletCore 返回了空的 extrinsic。
zh_hant: WalletCore 返回了空的 extrinsic。

source: WalletCore returned an empty signed ICP transaction.
zh_hans: WalletCore 返回了空的已签名 ICP 交易。
zh_hant: WalletCore 返回了空的已簽名 ICP 交易。

source: WalletCore returned an empty token transaction payload.
zh_hans: WalletCore 返回了空的代币交易载荷。
zh_hant: WalletCore 返回了空的代幣交易載荷。

source: WalletCore returned an empty TON payload.
zh_hans: WalletCore 返回了空的 TON 载荷。
zh_hant: WalletCore 返回了空的 TON 載荷。

source: WalletCore returned an invalid TON private key.
zh_hans: WalletCore 返回了无效的 TON 私钥。
zh_hant: WalletCore 返回了無效的 TON 私鑰。

source: WalletCore returned empty Aptos transaction JSON.
zh_hans: WalletCore 返回了空的 Aptos 交易 JSON。
zh_hant: WalletCore 返回了空的 Aptos 交易 JSON。

source: WalletCore returned empty transaction or signature payload.
zh_hans: WalletCore 返回了空的交易或签名载荷。
zh_hant: WalletCore 返回了空的交易或簽名載荷。

source: WalletCore returned non-UTF8 Aptos transaction JSON.
zh_hans: WalletCore 返回了非 UTF-8 的 Aptos 交易 JSON。
zh_hant: WalletCore 返回了非 UTF-8 的 Aptos 交易 JSON。

source: WalletCore Tron signer returned an empty signature.
zh_hans: WalletCore Tron 签名器返回了空签名。
zh_hant: WalletCore Tron 簽名器返回了空簽名。

source: Wallets
zh_hans: 钱包
zh_hant: 錢包

source: Wallets & Secrets
zh_hans: 钱包与密钥
zh_hant: 錢包與密鑰

source: Wallets: %lld
zh_hans: 钱包数：%lld
zh_hant: 錢包數：%lld

source: Warning
zh_hans: 警告
zh_hant: 警告

source: Watch Addresses
zh_hans: 观察地址
zh_hant: 觀察地址

source: Watching
zh_hans: 观察中
zh_hant: 觀察中

source: When enabled, balances only come from live RPC responses.
zh_hans: 启用后，余额只来自实时 RPC 响应。
zh_hant: 啓用後，餘額只來自實時 RPC 響應。

source: When many holders stake through decentralized validators, consensus remains more censorship-resistant, geographically distributed, and resilient to single points of failure.
zh_hans: 当大量持币者通过去中心化验证者进行质押时，共识会更抗审查、分布更广，也更能抵御单点故障。
zh_hant: 當大量持幣者通過去中心化驗證者進行質押時，共識會更抗審查、分布更廣，也更能抵御單點故障。

source: Where can I buy crypto?
zh_hans: 我可以在哪里购买加密货币？
zh_hant: 我可以在哪裡購買加密貨幣？

source: Why staking matters
zh_hans: 为什么质押很重要
zh_hant: 為什麼質押很重要

source: Word #%lld
zh_hans: 第 %lld 个单词
zh_hant: 第 %lld 個單詞

source: word %lld
zh_hans: 单词 %lld
zh_hant: 單詞 %lld

source: Write this down and keep it offline. Anyone with this phrase can control your funds.
zh_hans: 请写下并离线保存。任何拥有这组短语的人都可以控制你的资金。
zh_hant: 請寫下並離線保存。任何擁有這組短語的人都可以控制你的資金。

source: XRP broadcast failed: %@
zh_hans: XRP 广播失败：%@
zh_hant: XRP 廣播失敗：%@

source: XRP Ledger addresses start with r and are Base58 encoded.
zh_hans: XRP Ledger 地址以 r 开头，并采用 Base58 编码。
zh_hant: XRP Ledger 地址以 r 開頭，並採用 Base58 編碼。

source: XRP Ledger Network
zh_hans: XRP Ledger 网络
zh_hant: XRP Ledger 網絡

source: XRP network request failed: %@
zh_hans: XRP 网络请求失败：%@
zh_hant: XRP 網絡請求失敗：%@

source: Yes
zh_hans: 是
zh_hant: 是

source: Yesterday
zh_hans: 昨天
zh_hant: 昨天

source: You can keep rules configured even when alerts are disabled. Re-enable this later to resume notifications.
zh_hans: 即使提醒被禁用，你仍然可以保留规则配置。以后重新启用即可恢复通知。
zh_hant: 即使提醒被禁用，你仍然可以保留規則配置。以後重新啓用即可恢復通知。

source: You can update the label for this saved address. The chain, address, and note stay fixed.
zh_hans: 你可以更新这个已保存地址的标签。链、地址和备注会保持不变。
zh_hant: 你可以更新這個已保存地址的標籤。鏈、地址和備注會保持不變。

source: You can't recover this wallet after deletion until you still have this address.
zh_hans: 删除后将无法恢复此钱包，除非你仍保留该地址。
zh_hant: 刪除後將無法恢復此錢包，除非你仍保留該地址。

source: You must have your seed phrase backed up. Without it, you cannot recover your funds after reset.
zh_hans: 你必须已经备份助记词。没有它，重置后将无法恢复资金。
zh_hant: 你必須已經備份助記詞。沒有它，重置後將無法恢復資金。

source: Your %@ send from %@ failed on %@.
zh_hans: 您从 %@ 发出的 %@ 转账已在 %@ 上失败。
zh_hant: 您從 %@ 發出的 %@ 轉賬已在 %@ 上失敗。

source: Your %@ send from %@ is now confirmed on %@.
zh_hans: 您从 %@ 发出的 %@ 转账现已在 %@ 上确认。
zh_hant: 您從 %@ 發出的 %@ 轉賬現已在 %@ 上確認。
